<a href="https://colab.research.google.com/github/oktaviacitra/data-mining/blob/main/Assignment6.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Import Libraries

In [ ]:
import pandas as pd
from google.colab import drive
from sklearn import tree
from sklearn.tree import DecisionTreeClassifier
import graphviz

# Connect to Google Drive

In [ ]:
drive.mount('/content/drive')

Mounted at /content/drive

# Read Files

In [ ]:
path = "/content/drive/MyDrive/Data Mining/"

## Train

In [ ]:
train_dataset = pd.read_csv(path + "titanic.csv")
train_dataset.head(5)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

## Test

In [ ]:
test_dataset = pd.read_csv(path + "titanic_test.csv")
test_dataset.head(5)

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

## Test Label

In [ ]:
test_label = pd.read_csv(path + "titanic_testlabel.csv")
test_label.head(5)

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

# Take Some of The Necessary Features

## Train

In [ ]:
train_data = train_dataset.loc[:, ['Age', 'Fare', 'Pclass', 'Sex']].fillna(train_dataset.mean())
train_data.head(5)

    Age     Fare  Pclass     Sex
0  22.0   7.2500       3    male
1  38.0  71.2833       1  female
2  26.0   7.9250       3  female
3  35.0  53.1000       1  female
4  35.0   8.0500       3    male

In [ ]:
train_data = train_data.replace({'female':1, 'male':0})

In [ ]:
train_label = train_dataset.loc[:, ['Survived']]
train_label.head(5)

   Survived
0         0
1         1
2         1
3         1
4         0

## Test

In [ ]:
test_data = test_dataset.loc[:, ['Age', 'Fare', 'Pclass', 'Sex']]
test_data.head(5)

    Age     Fare  Pclass     Sex
0  34.5   7.8292       3    male
1  47.0   7.0000       3  female
2  62.0   9.6875       2    male
3  27.0   8.6625       3    male
4  22.0  12.2875       3  female

In [ ]:
test_data = test_data.replace({'female':1, 'male':0})

In [ ]:
test_label = test_label.loc[:, ['Survived']]
test_label.head(5)

   Survived
0         0
1         1
2         0
3         0
4         1

# Decision Tree

## Class Result

In [ ]:
pos_missing_test = [index for index, row in test_data.iterrows() if row.isnull().any()]
test_data = test_data.dropna()
test_label = test_label.drop(pos_missing_test)

In [ ]:
dtc = DecisionTreeClassifier()
dtc.fit(train_data, train_label)
class_result = dtc.predict(test_data)
class_result

array([0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1, 0,
       1, 0, 1, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0,
       1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1,
       0, 1, 1, 0, 0, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0,
       0, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0,
       1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0,
       1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0,
       1, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1,
       1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0,
       1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1,
       0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1,
       1, 1, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       1, 1, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 0, 1,
       0])

## Error Ratio

In [ ]:
accuracy = dtc.score(test_data, test_label)
error_ratio = round((1 - accuracy) * 100, 2)
print("Error Ratio = ", error_ratio, "%")

Error Ratio =  18.43 %

## Graph

In [ ]:
dot_data = tree.export_graphviz(dtc, out_file = None, feature_names= train_data.columns.values)
with open("Source.gv") as f:
    dot_graph = f.read()
graphviz.Source(dot_graph)

FileNotFoundError: ignored